app/controllers/trades_controller.rb

  def index
  	@buy_sell_strings = {'B' => 'Buy', 'S' => 'Sell'}
  	@portfolio_total = 0
  	Trade.all.each do |mtm_value|
---
SELECT "trades".* FROM "trades"