app/views/trades/index.html.erb

SELECT "trades".* FROM "trades"
---
	<tbody>
		<% Trade.all.each do |trade|%>